app/Controllers/Home.php

    public function showAllUser()
    {
        $userModel = new \App\Models\UserModel();

        $users = $userModel->findAll();
---
SELECT *
FROM `users`

    public function insertUser(){
        $userModel = new \App\Models\UserModel();

        $data = [
            'email' => 'toledana.ian@gmail.com',
            'password' => password_hash('123456', PASSWORD_DEFAULT ),
            'fname' => 'Christian',
            'mname' => 'Barola',
            'lname' => 'Toledana',
            'status' => 0,
        ];

        $userModel->insert($data);
---
INSERT INTO `users` (`email`, `password`, `fname`, `mname`, `lname`, `status`, `created_at`, `updated_at`) VALUES ('toledana.ian@gmail.com', '$2y$10$fEeDqPgo6aKQOvID9Xf.NuWnim.Xd0vQj8HAxMYc04ZKWJtMIoZwq', 'Christian', 'Barola', 'Toledana', 0, '2022-02-09 10:55:38', '2022-02-09 10:55:38')