app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `email` = 'toledana@gmail.com'
 LIMIT 1
---
    public function login()
    {
        helper(['form']);

        if (count($_POST) == 0) {
            echo view('users/login');
            return 0;
        }

        $errors = [];

        if($this->request->getVar('email')==''){
            array_push($errors, 'Email should not be empty!');
        }
        if($this->request->getVar('password')==''){
            array_push($errors, 'Password should not be empty!');
        }

        $session = session();
        $model = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = [];

        if(count($errors)==0){
            $data = $model->where('email', $email)->first();